Tekla Open API Reference for Tekla Structures 2025
LineTypeAttributes Constructor (LineTypes, DrawingColors)
 Creates a new line type attributes instance with the given line type and color.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LineTypeAttributes(
	LineTypes lineType,
	DrawingColors color
)
Public Sub New (
	lineType As LineTypes,
	color As DrawingColors
)
Parameters
lineType
Type: Tekla.Structures.Drawing.LineTypes
The line type to be used.
color
Type: Tekla.Structures.Drawing.DrawingColors
The color to be used.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | Throws an exception if the color has an unsupported value. Value must be standard color value.
See Also
Reference
LineTypeAttributes Class
LineTypeAttributes Overload
Tekla.Structures.Drawing Namespace